reinforcement_learning/abundant-take-home/research/zenoh-coverage-followup-2026-09-14/mutants/omit-zero-config-rejection.patch
diff --git a/commons/zenoh-codec/src/network/timestamp_stack.rs b/commons/zenoh-codec/src/network/timestamp_stack.rs
--- a/commons/zenoh-codec/src/network/timestamp_stack.rs
+++ b/commons/zenoh-codec/src/network/timestamp_stack.rs
@@ -92,10 +92,6 @@
 
     fn read(self, reader: &mut R) -> Result<TimestampStack, Self::Error> {
         let conf_flags: u8 = self.read(&mut *reader)?;
-        if conf_flags == 0 {
-            // empty conf_flags is invalid
-            return Err(DidntRead);
-        }
         let count: usize = self.read(&mut *reader)?;
         if count > zenoh_protocol::network::timestamp_stack::MAX_STACK_SIZE {
             return Err(DidntRead);
